Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 할만해?
en_us: is it doable?

source: 데이트?
en_us: a date?

source: 헉...
en_us: HUFF

source: 꺄아~
en_us: KYAHHH

source: 그만해 이제~
en_us: you can stop it now~

source: 여기서 40kg을 빼라고!?
en_us: I have to lose a hundred pounds?!

source: 그럼 꽤나 인기를 얻게 될지두~ 우헷!
en_us: then I might become popular too, haha!

source: 아냐, 아냐...
en_us: no, no...

source: 키즈카페
en_us: Kids Playground

source: 어머 시원아~
en_us: oh my, siwon!

source: 더욱 더...
en_us: literally...

source: 에엣...
en_us: UHM...

source: 그냥, 걔 이번에 운동하는 거 보니까…
en_us: well, seeing him exercise like that...

source: 살이 제법 빠졌다고 생각했는데…
en_us: ...I lost a lot of weight.

source: 나?
en_us: me?

source: 그래?
en_us: really?

source: 야, 너 내가 우습냐?
en_us: hey. am I a joke to you?

source: 교훈
en_us: Class Motto

source: 잘 나가다가 얘가 지금 뭔 소리 하는 거야?
en_us: what the heck is this kid talking about?

source: 운동양을 그렇게 늘렸는데 굶기까지 하면 어떡하냐구, 응!?
en_us: your workouts are harder now! did you really think you could handle them while starving yourself?!

source: 노래는 갑자기 왜 부르는데!!
en_us: why is everyone singing all of a sudden?!

source: 내일 운동 끝나면 소고기라도 사줘야겠다~
en_us: I should treat him to some steak tomorrow after his workout.

source: 간주점프
en_us: Skip instrumental

source: 이럴 줄 알았어….
en_us: I knew it...

source: 밥 먹을 시간에 몇 번 더 걷지 뭐.
en_us: I’m going to walk some more instead of eating.

source: 웃기당ㅋㅋㅋㅋ
en_us: funny lololol

source: 우앵
en_us: SOB

source: 아니지, 동급은 아니지~
en_us: wait, actually. we can’t be equals...

source: 꽈악
en_us: SQUEEZE

source: 그런 말 한 적 없음
en_us: never said such a thing

source: 야아!
en_us: hey!

source: 스윽
en_us: GRAB

source: 보쿠라 타이무 쿠라이마~
en_us: bokura taimu kuraima~

source: 울 얼음왕자 시원이가 웬 일이래~?!
en_us: my ice prince said yes to a date!!!

source: 어째선지...
en_us: somehow...

source: 집에서 나코쨩 덕질하는 게 제일 좋아!!!!
en_us: I just want to stan nako-chan all day at home!!!!

source: 쉿!
en_us: shhh!

source: 기록을 남겨야 할 것 같아.
en_us: I should keep a record.

source: 대박!!
en_us: awesome!!!

source: 이렇게 의지가 약하면 변할 수 없어!!
en_us: I can’t change if I get weak like this!!

source: 슥슥
en_us: SCRITCH SCRITCH

source: 뭐!?
en_us: what?!

source: 김민호?
en_us: minho?

source: 완전 과즙상...
en_us: she’s so cute!

source: 끼익
en_us: CREAK

source: 그 정도야?
en_us: is it that bad?

source: 잉스타에서 자랑하던 한강뷰 아파트도 백시원 집이잖아.
en_us: the apartment by the han river she posted on instar is siwon’s, not hers.

source: 두번째로는, 이벤트!
en_us: second, plan a surprise event!

source: 안 데려다 주고!
en_us: walk her home!

source: 강아지 산책도 같이 하고!
en_us: we walked the dog too!

source: 장소더하기
en_us: PLUS MORE

source: 성인이 돼서도 이딴 구린 집에서 살 수는 없다고!!
en_us: I won’t continue to live in this awful house even as an adult!!!

source: 우리는,
en_us: we decided...

source: 얘가 미쳤어!?
en_us: are you serious? really?!

source: 부럽다, 둘이 너무 잘 어울려~
en_us: I’m envious. you two look really good together!

source: 서울이 자 호프 소주 안주 일체
en_us: Seoul Bar Beer, Soju, and Good Food

source: 설마 계속 뉴튜브 찍으려고?
en_us: you plan to keep creating videos?

source: 왜?
en_us: why?

source: 응응, 천천히 입고 나와~
en_us: mm-hm, take your time!

source: 다른 것도 아니고 햄버거잖아, 채소가 들어있어!
en_us: don’t worry! there are vegetables in this burger!

source: 너 이제 오덕말투 줄었다?
en_us: you don’t talk so much like a geek anymore.

source: 벌써 3kg나 더 감량했잖아!!
en_us: I lost seven pounds already anyway!!!

source: 척!
en_us: DUN

source: 어머니가 엄청 미인이시네~
en_us: wow, his mom is beautiful.

source: 너희 원래 이러고 놀아…?
en_us: is this how you guys normally hang out...?

source: 우리는 달라진 모습을 보여줘야만 한다.
en_us: ...we have to change.

source: 으아아
en_us: AAAH

source: 초코맛...
en_us: chocolate flavored...

source: 쟤가 웬일이래~
en_us: I wonder what’s gotten into him...

source: 진짜 대박!!!
en_us: amazing!!!

source: 헬스장
en_us: of Youth

source: 표준이하 표준 표준이상
en_us: Below Standard Standard Above Standard

source: 좋아요 7,065개
en_us: 7,065 likes

source: 야, 이...
en_us: hey, you...

source: 오늘 무슨 날인가...
en_us: is today a special day or something?

source: Cafe 옐랑
en_us: Yellang Cafe

source: 모든 것이 순조롭게 흘러갔다.
en_us: ...so everything went smoothly.

source: 구미가 당기지!
en_us: sounds awesome, right?

source: 네가 나코짱 이전에 좋아했던 여자가 있었단 말이지...!?
en_us: so you liked a girl before nako-chan?!

source: 하하!
en_us: HAHA

source: 두둥!
en_us: DA DUN

source: 이건 너무 불공평해.
en_us: this is unfair.

source: 슈베르트 교향곡 뭐시기...
en_us: something by schubart? schubert?

source: 학교 뒤뜰에서 촛불이벤트 고백 받았습니다.
en_us: A Surprise Candlelight Confession at School

source: 그리고 이 공간에...
en_us: and amidst them all...

source: 이래도 달라진게 없어?
en_us: does it look like you haven’t changed one bit?

source: 시끌 시끌
en_us: CHATTER CHATTER

source: 층간소음 걱정없이 유산소 집 안에서 뿌수기 14
en_us: Fat Burning Home Workout No Noise 14

source: 꼬르륵
en_us: GROWL

source: 저기, 시아쨩… 가족들은 우리 콘텐츠 찍는 거 모르셔?
en_us: um, sia-chan... your family doesn’t know about our newtube project?

source: 말로만 듣던 촛불 이벤트를 받았다고!?
en_us: so he prepared a candlelight event for you?!

source: 그, 그게…
en_us: w-well...

source: ㅋㅋㅋㅋ
en_us: LOL

source: 어휴, 뺄 데가 어디있다고 그러니~
en_us: geez, he doesn’t have any weight to lose though...

source: 사진관 사진네컷
en_us: Photo Studio

source: 너무 너무 열받아!!!!
en_us: I’m sooo pissed!!!!

source: 지금부터 시작인데...
en_us: but we’re only getting started...

source: 휙!
en_us: TURN

source: 물론 지금 당장 사귀자는 건 아니고...
en_us: not right now, of course. we can start dating...

source: 타닥
en_us: TAP TAP

source: 강보배도...
en_us: ...is bobae kang.

source: 우리 집에 1세대부터 10세대 까지 모든 게임이 다 있다고!!
en_us: I have all the versions from the first to the tenth back at home!!!

source: 충격적인 윤시아 새남친 정체공개!?
en_us: Sia Yoon’s shocking new boyfriend!!!

source: 어디 한 번 털어볼까!
en_us: what minho looked like in the past!

source: 부들 부들
en_us: TREMBLE TREMBLE

source: 나 따위가 뭐라고...!
en_us: you deserve better than me!

source: 이쪽으로 와~
en_us: This is the place!

source: 그러고보니 다른 가족들은 다 어디 계셔?
en_us: by the way, where’s the rest of your family?

source: 네, 네...?
en_us: wh-what?

source: 침대에서 냄새가 나는 걸 보니 한동안 세탁하지 않은 것 같고...
en_us: judging from the smell of his bed... it’s been forever since he washed the sheets...

source: 나랑 사귈래?
en_us: ...how about dating me?

source: 싱
en_us: ING

source: 내가 이럴 줄 알았어!!
en_us: I knew it!!!

source: 저, 저게 어디서 튀어나온 거야!
en_us: wh-where did she pop out from?

source: 아무리 우리가 멀어져도, 나코쨩과 나의 우정은 절대 잊으면 안 된다!!
en_us: even if we grow apart, don’t you ever forget your friendship with nako-chan and me!!!

source: 햄버거는 선 넘었지~
en_us: no, no. you’re crossing the line!

source: 인싱
en_us: NSING

source: 슥
en_us: GLANCE

source: 두근!
en_us: THUMP

source: 안녕하세요~
en_us: hello!

source: 불만이 있었던 거 같아서 식단도 강화했고^^
en_us: I also changed his meal plan, because he seemed dissatisfied. hehe.

source: 괜찮아…
en_us: it’s okay...

source: 며칠 후...
en_us: a few days later...

source: 청춘 헬스장 3F
en_us: Gym of Youth 3F

source: 라고만 생각했었는데...!!!
en_us: or so I thought!!!

source: 헉 헉
en_us: HUFF HUFF

source: 춘 헬스장
en_us: m of Youth

source: 어쩔 수 없는 거 치곤 행복한 미소를 짓고 있던데...
en_us: but your smile seemed pretty genuine for a picture you couldn’t help but take.

source: 사랑스러운 얼굴과, 귀여운 목소리...
en_us: she has an adorable face and a cute voice...

source: 난 윤꽃분이야.
en_us: I’m daisy yoon.

source: 오늘부터 난 민호 오빠를 관찰하게 되었다.
en_us: ...to observe my brother starting today.

source: 어, 어어...
en_us: uh, y-yeah...

source: 보청기 J 진안
en_us: Hearing Aids J Jin An

source: 온바디 측정 후...
en_us: after getting his measurements...

source: 이게 아닌데...!!!
en_us: this wasn’t supposed to happen!!!

source: 같이 가야지!!
en_us: wait for me!!!

source: 쓰담
en_us: PET

source: 뭐야!!!
en_us: ...is this?!?!

source: 일단 메이크업 영상이라도 찍어볼까!?
en_us: should I try a makeup tutorial?

source: 난 이런 거 처음인데!!
en_us: I’ve never done this before!

source: 젠장 성환쿤-!!
en_us: dammit seonghwan-kun!!!

source: 어때, 딱 우리 맞춤형 아니야?
en_us: isn’t that perfect for our project?

source: 나도 어엿한 사회의 일원이 된 기분이랄까-
en_us: ...makes me feel like I’m a part of this society.

source: 노크 하랬지!
en_us: don’t you know how to knock?

source: 그게...
en_us: well...

source: 시아루~!
en_us: Hi Sialoves!

source: 안 돼 김민호!!!
en_us: minho! nooo!!!

source: 방학이 되기 전 실천할 수 있는 간단한 루틴을 만들었다.
en_us: ...and created a simple routine to follow until vacation started.

source: 촬영 다 했니?
en_us: is the shoot now finished?

source: 진짜 골 때리는 애네...
en_us: he really is something...

source: 진짜 열심히 하네…
en_us: he’s really exercising hard.

source: 내가 좋아하는 게 있긴 한가?
en_us: is there anything that I even like?

source: 이래서 다들 어그로를 끄는 건가...?
en_us: is this why everyone uses so much clickbait?

source: 그게 아니고...
en_us: this isn’t what you think...

source: 시아한테 다 이른다?
en_us: I’m gonna tell sia!

source: 시아쨩이 왜 이렇게 늦지…
en_us: what’s taking sia-chan so long...?

source: 나코짱의 귀여움과 용맹함을 따라올 자는 아무도 없어!
en_us: no one can match nako-chan’s cuteness and bravery!

source: 응?
en_us: huh?

source: 중대 소식이 있으니 궁금하신 분들은 꼭 들어와주세요! <3
en_us: I have a very important announcement, so please come if you’re curious! <3

source: 그 날 이후...
en_us: and so...

source: 민호 되게 열심히 하네요!
en_us: Minho is working so hard for this!

source: 5화
en_us: Episode 5

source: 그럼 미리 말 하지, 배고픈 거 참고 있었는데~
en_us: then you should have told me sooner. I’m hungry but still waited...

source: 장난이야, 장난~
en_us: hehe, I was just playing.

source: 미미짱이 아니라 나코짱이라구!!!
en_us: she’s nako-chan! not mimi-chan!!!

source: 웬 편지가 여기에...
en_us: a letter?

source: 끝났다!!!
en_us: done!!!

source: 그런데...
en_us: but...

source: 오늘도 일찍 일어났네?
en_us: you’re up early today, too.

source: 딱 스무살이 되었을 때 더 근사한 집으로 갈 수 있게!
en_us: then, as soon as I turn 20, I’m going to move into a really nice house!

source: 휙
en_us: WHISH

source: 으음...
en_us: umm...

source: 가까이 오지 말라고 했잖아.
en_us: I told you not to come near me.

source: 하하하
en_us: HAHA

source: 아...
en_us: oh...

source: 그런가...
en_us: it is...?

source: 본판이 꽤 괜찮을 수도 있다는 거네!!??
en_us: that means he has a good-looking face to begin with!!!

source: 탁!
en_us: SNATCH

source: 내 기준에 미치려면 아직 한참 부족하거든!?
en_us: he’s far from meeting them!!!

source: 게시물이 올라오지 않
en_us: but it isn’t up yet, so

source: 스장
en_us: f Youth

source: 허억...
en_us: HUFF

source: 그, 그렇구나…
en_us: I-I see...

source: 알아서 할게...
en_us: I’ll take care of my own matters...

source: 공개 계정으론 팔로우 하지 않은
en_us: ...to follow many influencers...

source: 두근 두근
en_us: BA-BUMP BA-BUMP

source: 내 목표는 골드버튼이니까…!
en_us: my goal is to get a gold button!

source: 새로운 다이어트 방법에 흥미를 붙였으며,
en_us: ...enjoyed the new diet...

source: 후욱 후욱
en_us: HUFF HUFF

source: 청춘 헬스장
en_us: Gym of Youth

source: 하...
en_us: ha...

source: 첫 등장을 어떻게 할 지부터 생각해봐...!
en_us: and think about how you want to make your first appearance!

source: 예매가 빨라집니다!
en_us: Buying tickets is easier!

source: 이렇게...
en_us: so...

source: 셀카나 찍어볼까...
en_us: maybe I should take a selfie...

source: 보청기
en_us: Hearing Aids

source: 민호는 이제,
en_us: now, minho...

source: 얘네 진짜 웃긴다~
en_us: how ridiculous!

source: 반드시!!
en_us: no matter what!!!

source: 그 애가 날 알아보진 못 했는데...
en_us: she didn’t recognize me...

source: 빵!
en_us: PUAHAHA

source: 오늘 정말 재미있었어!
en_us: it was a lot of fun today!

source: 그랬지...
en_us: that’s right...

source: 역시 대표님 안목이 좋았어~
en_us: our boss really has a good eye.

source: 넙죽!
en_us: BOW

source: 으음, 다른 건 아니고...
en_us: um, I was just curious...

source: 마음을 전하지도 못한채 끝나버리고 말았지만 말이다...
en_us: it all ended even before I had the chance to confess my feelings to her...

source: 우리 오빠한테 이런 기회가 생기다니...
en_us: who knew minho would get an opportunity like this?

source: 네 말대로 하는 것도 뭐...{j}괜찮은 거 같네.
en_us: your suggestion sounds pretty good.{j}

source: 익명 17
en_us: Anonymous 17

source: 나에게는 아직 30만 잉스타 팔로워가 남아있다구!
en_us: I still have 300k instar followers!

source: 제발요~
en_us: please?

source: 어라라...
en_us: oh...

source: 허둥지둥
en_us: RUSH

source: 딱 하나 달라진 게 있다면...
en_us: except for one thing.

source: 곧 있으면 게시글 좋아요 수 2만 넘기겠다.
en_us: this post might hit 20,000 likes soon.

source: 다 널 위해서 이러는 거잖아!!
en_us: this is all for your sake!

source: 드디어 결전의 날이야!
en_us: it’s a really important day today!

source: 나도 어제 밤새도록 검색해 보느라 힘들었다구!!!
en_us: I even pulled an all-nighter last night researching!!!

source: 나는 학원 다니기 싫어서...
en_us: I didn’t like any of them,

source: 시아 언니의 부탁으로,
en_us: sia asked me...

source: 풀썩
en_us: FLOP

source: 저렇게까지 행복해하고,
en_us: he likes this so much...

source: 오예~ 신난다~~
en_us: woohoo! I’m so excited!!!

source: 뭐해, 빨리 지워!
en_us: hurry, delete it!

source: 소곤 소곤
en_us: WHISPER WHISPER

source: 웅성
en_us: HUBBUB

source: 너희 둘 붙어있는 거 보니까 옛날 생각이 새록 새록 나는구나~
en_us: seeing you two together reminds me of the good ol’ days!

source: 뿌앵
en_us: WAAAH

source: 저기… 나 음료수 좀 가져올게
en_us: um... I’m going to get some drinks.

source: 지금의 내 모습에 정말 자신이 없었거든...
en_us: ...but I wasn’t confident about how I look now.

source: 김민호
en_us: ...looks like he’s in a good mood.

source: 우리 헤어지자.
en_us: let’s break up.

source: 유경민
en_us: Gyeongmin Yu

source: 쪽팔리지도 않나봐ㅠㅠ
en_us: She has such thick skin, doesn’t she??

source: 눈치…
en_us: GLANCE

source: 저런 놈들 진짜 극혐...
en_us: I really hate those kinds of people...

source: 너희들 사귀지?
en_us: you two are dating, aren’t you?

source: 설마...
en_us: then...

source: 이럴줄 알았어...
en_us: I knew it...

source: 야수들의 땀냄새...
en_us: the smell of sweating beasts...

source: (끔찍!)
en_us: (nooo!)

source: (구라)
en_us: (lies)

source: 내남친 킹카 만들기
en_us: My Dud to Stud Boyfriend

source: 우리 집에서는 할 수 있는 게 아무 것도 없어.
en_us: I can’t do anything here.

source: 아무한테도 말 안 할게, 이거 하나 쯤은 괜찮다구.
en_us: having just one should be okay. I won’t tell anyone.

source: 항상 그랬지.
en_us: always.

source: 오빠가 조금 불쌍하게 느껴지지만...
en_us: I felt a bit bad for minho...

source: 거야.
en_us: is.

source: 자, 이제 20번 남았다!
en_us: just 20 more!

source: 시아쨩이잖아?
en_us: it’s sia-chan!

source: 어때, 나 살 좀 빠진 거 같아?
en_us: so what do you think? do I look like I lost weight?

source: 음...
en_us: hmmm...

source: 에, 에엣… 저 싸인이 없는데…
en_us: e-eh...? but I don’t have an autograph...

source: 세, 셀카 둘이서?
en_us: a s-selfie? just us two?

source: 난 민호의 원래 모습을 기억한다.
en_us: ...but I remember how he used to look.

source: 이름은 김민호예요!
en_us: his name is minho kim!

source: 아~ 그런데 윤시아 그 X는 언제 잡아 족치냐..
en_us: ugh! but when will I get back at that b*tch, sia?

source: 그 애라고…?
en_us: ...is you?

source: 그럼 그 잘난 나코짱 목소리를 친구들한테 공유해볼까?
en_us: how about we let everyone hear your favorite nako-chan’s voice?

source: ㅠㅠ
en_us: stop!

source: 나처럼 예쁜 애가 같이 뉴튜브 찍자고 하면 당연히 같이 해야하는 거 아냐?
en_us: if a pretty girl like me asks him to film newtube vids together, isn’t the answer an obvious “yes”?

source: 시아의 아침
en_us: sia’s morning

source: 운동 다녀왔어?
en_us: did you work out?

source: 어이,
en_us: hey.

source: 히이이익!?
en_us: eeeek!!!

source: 이건 1일 1식 전에 찍어뒀던 네 사진이야.
en_us: and this is a picture of you just before you began the one meal a day diet.

source: 그렇게 자연스럽게...
en_us: and naturally...

source: 역시 시아쨩!
en_us: I knew it, sia-chan!

source: 어디 아픈 거 아니지?
en_us: are you sick?

source: 추가된 날짜(최신순)
en_us: DATE ADDED (NEWEST)

source: 그, 그건...
en_us: th-that’s...

source: 늘 똑같은 풍경,
en_us: everything is the same.

source: 아, 안 돼..!!
en_us: n-no!!!

source: 헤헤헤...
en_us: hehehe...

source: 민호야,
en_us: minho...

source: 오늘은…
en_us: I decided...

source: 터덜 터덜
en_us: TRUDGE TRUDGE

source: 하아...
en_us: ha...

source: 후훗~ 그래 그래, 더 부러워 해~!
en_us: hehe! yes, yes! be jealous of me!

source: (고)시텔 (고)시텔 4F
en_us: Rooms Rooms 4F

source: 넌 노래방 룰이란 것도 모르냐!?
en_us: don’t you even know the rules of singing in a karaoke room?!

source: 신장 178.7 cm
en_us: Height 5 ft 10 in

source: 헤어지자.
en_us: let’s end this.

source: 아침 고구마 1개 저지방 우유 사과 1개
en_us: Breakfast 1 sweet potato Low-fat milk Apple

source: 우웅 우웅
en_us: VRRR VRRR

source: 뭐?
en_us: what?

source: 하긴...
en_us: true...

source: 음..
en_us: hmm...

source: 그걸로 되겠어?
en_us: that’s it?

source: 저 옷도 아냐…
en_us: not that either...

source: 어머, 저 친구가 네가 말한 시원이보다 백배 천배 낫다던 그 남친?
en_us: oh! is he the boyfriend who’s a million times better than siwon?

source: 그때 그 모습으로 되돌려 줄 것이다.
en_us: ...bring back the old minho, no matter what.

source: 그리고 그 중엔...
en_us: one of them...

source: 윤시아...?
en_us: sia...?

source: 아, 안녕하십니까!!
en_us: h-hello, sir!

source: 뉴튜브… 네 꿈이 달린 일이니까,
en_us: because your newtube channel... your dream depends on this.

source: 코찔찔이래요~
en_us: he’s a snot-face!

source: 코인싱
en_us: COINSING

source: 탁
en_us: STOMP

source: ㅋㅋ 그래?
en_us: haha, is that so?

source: 저, 저 녀석...!!!
en_us: th-that kid-!!!

source: 가장 먼저...
en_us: the very first thing we did...

source: 성환쿤이 먼저 다가와줬었지.
en_us: then, seonghwan-kun approached me.

source: 괜히 구해줬네...
en_us: I shouldn’t have helped him...

source: 마상...
en_us: that hurts...

source: 큰일났다구...
en_us: I’m in trouble...

source: 뭔가 좋은 생각이...
en_us: I have a good idea.

source: 뿌듯해!!!
en_us: I feel proud of myself!!!

source: 쪽팔려서 어디 말 하지도 못 하고…
en_us: and I can’t vent about this to anyone because it’s so humiliating...

source: 고구마 두 개...
en_us: earlier...

source: 후우
en_us: SIGH

source: 누...
en_us: who...

source: 오늘 그거 첫 날이야.
en_us: today’s the first day.

source: 와 저 피규어 22년 한정판 아닌가요ㅋㅋ찐이네ㅋㅋ
en_us: whoa! isn’t that figure a limited edition that was only available this year? lol, he’s for real!

source: 빨래 널어 놨어?
en_us: did you do the laundry?

source: 100일 안에 초절정 훈남으로 만들어 놓을 거니까요!!!
en_us: ...into a handsome, superstud of a boyfriend!!! all in 100 days!

source: 엉엉
en_us: SOB SOB

source: ㅋㅋㅋ
en_us: LOL

source: 이정도가 딱 보기 좋아.
en_us: you have just the right amount of flesh.

source: 하아…
en_us: sigh...

source: 2.7만 싫어요 공유 다운로드 저장
en_us: 27K Dislike Share Download Save

source: 웬만하면 체중보단 눈바디를 체크하는 게 좋고!
en_us: it’ll be better to focus on visual feedback instead of using a scale, too!

source: 아마 여동생 방에 더 있을 거야.
en_us: there are more in my sister’s room.

source: 화이팅!
en_us: keep it up!

source: 보건실
en_us: Nurse’s Office

source: 잘 생겨지고 싶다며!!
en_us: you said you wanted to be handsome!!!

source: 민호네 아파트
en_us: minho’s apartment

source: 좋아!!
en_us: great!!!

source: [성검말고마검]
en_us: [Holy Enchantment]

source: 뭐어어어어!!?!?!?
en_us: whaaaaaat?!!!

source: ㅎㅎ
en_us: HEHE

source: 위풍당당하던 나의 초딩 시절,
en_us: I used to be really proud and confident in elementary school.

source: 토독 토독
en_us: TAP TAP

source: 까부는 것 뿐이냐?
en_us: oh, no. that won’t be enough.

source: 너 지금 뭐 찍냐?
en_us: what are you filming right now?

source: 큐브몬스터 극장판…
en_us: you know that cube monster movie...

source: 샌드
en_us: LAND

source: 티켓
en_us: Ticket

source: 열심이네…
en_us: he’s working out hard...

source: 이세계 장래희
en_us: My Dream?

source: 시아쨩!
en_us: sia-chan!

source: 수군
en_us: WHISPER

source: 그 이유는...
en_us: because...

source: 쌩~
en_us: ZIP

source: 지금 너는 기초대사량을 늘리는 게 중요해.
en_us: the most important thing for you right now is to raise your basal metabolism.

source: 현기증 나...
en_us: I’m dizzy...

source: 108.4 kg
en_us: 238.9 lbs

source: 그나저나...
en_us: but wow...

source: 이거라도 먹어, 민호킁!
en_us: here, have this, minho-kun!

source: 뉴튜브를 같이 찍을 수 있냐고...?
en_us: film newtube vids?

source: 오이오이~ 민호 짱은 나보다 미미짱이 더 좋은거냐구~!!
en_us: oy, oy! minho-chan! do you like mimi-chan better than meee?

source: 턱선보인다 보여~~~
en_us: I see a few chins!

source: 우헤헤
en_us: HEHEHE

source: 저, 저기...
en_us: uh... h-hey...

source: 아아, 내 도모다찌와 중학생때 같이 찍은 사진이야.
en_us: oh, that’s a picture of me with my tomodachi (friend) when we were in middle school.

source: 트와즈원
en_us: twize-one

source: 19화
en_us: Episode 19

source: 이제야 좀 네 급에 맞게 사귀는 거 같네~
en_us: you’re finally dating someone who’s at your level.

source: 촤르륵
en_us: SCROLL

source: 어엉, 다녀와~
en_us: mm-hm, see you!

source: 자세하게 설명해봐.
en_us: tell me everything.

source: 참나!
en_us: geez!

source: 푸쉬쉬
en_us: PSHHH

source: 돈이 어디서 나긴?
en_us: expensive?

source: 민호는 알지 못했다.
en_us: minho had no idea...

source: 그럼 그렇지...
en_us: no wonder...

source: 뭐어?
en_us: what?

source: 우적 우적
en_us: MUNCH MUNCH

source: 2cm 정도…
en_us: about an inch...

source: 퍽!!
en_us: WHACK

source: 런지나 한 두세트 더 할까?
en_us: how about doing a couple more sets of lunges?

source: 히에에에에!??
en_us: GAAAASP

source: 윤시아 걔는 좀 아니잖아~
en_us: sia was way below your level, wasn’t she?

source: 보글
en_us: BOIL

source: 내 남친 킹카 만들기 10화
en_us: My Dud to Stud Boyfriend Episode 10

source: 쿠궁
en_us: DA DUN

source: 헤헤…나도 놀랐어, 이 정도일 줄이야~
en_us: hehe... I was surprised too. who knew...

source: 애초에 여기에 오는게 아니었는데...!!
en_us: I shouldn’t have come here!!!

source: 시, 시아쨩이 왜, 왜왜왜왜왜!!???!
en_us: s-sia-chan! wh-what’s gotten into you?!!!

source: 미, 미안해!
en_us: s-sorry!

source: 버둥 버둥
en_us: FLAIL FLAIL

source: 아프잖아!!
en_us: that hurt!!!

source: 욕심은 버리고 계속 꾸준히 열심히 하라고!
en_us: don’t get too greedy. just keep at it consistently!

source: 코인
en_us: COINS

source: 천사떡볶이
en_us: Angel’s Tteokbokki

source: 너무 힘들어~!!!
en_us: I’m so exhausted!!!

source: 그 다음으론 요가로 몸을 풀어줘요.
en_us: then I do yoga to stretch my body.

source: 헤벌레~
en_us: HEHE

source: 프로젝트가 끝날 때까지 민호에게 체중을 알려주지 않기로 했다.
en_us: ...to not tell minho his weight until the project was over.

source: 잠, 잠깐...
en_us: w-wait...

source: 왜~ 걔 진짜 골때리던데, 같이 콘텐츠 찍기 딱 좋지 않아?
en_us: come on, he’s really something! perfect for your videos, isn’t he?

source: 그러니까~ 프로젝트 신경쓰느라 어디 놀러가지도 못 했네.
en_us: yeah, we couldn’t go anywhere because we were focused on the project.

source: 영화는 나쁘지 않았따.
en_us: the movie wasn’t bad.

source: 으음…옷은 괜찮은 거 같은데 뭔가 안 어울려…
en_us: UHM...

source: 그래서 아빠한테 남은건…
en_us: all my dad has left to remember her now...

source: 챱챱
en_us: PAT PAT

source: 정신차려, 김민호!
en_us: get your act together, minho kim!

source: 호흡이 편해졌다.
en_us: even breathing was easier.

source: 내가 네 친구냐?
en_us: you think I’m your friend or something?

source: 현실세상'에서 말이다.
en_us: ...in the real world.

source: 잠깐!!
en_us: wait!!!

source: 으악, 땀냄새!
en_us: ewww, you reek of sweat!

source: 너 운동 갔다오더니 기분 좋아보인다?
en_us: you look like you’re in a better mood after your workout.

source: 이 사람들 사이에 내가 껴있으니,
en_us: being amongst all these people...

source: 오빠는...
en_us: my brother...

source: 퍽!
en_us: JAB

source: 녹음 스코어
en_us: Record Score

source: 뒤돌아보면 안 돼…!!
en_us: I can’t turn around!!!

source: 쿠당탕탕!
en_us: TUMBLE

source: 김민호가 좋아하는 것' 에피소드 마침
en_us: The End of Episode What Minho Likes Best

source: 우리 모두 힘을 합쳐 싸우면 해낼 수 있어!! *일본어
en_us: if we team up and fight together, we can win!!! *japanese

source: 광고!
en_us: the ad!

source: 가장 쉬운 방법...?
en_us: an easy way?

source: 헉헉
en_us: PANT PANT

source: 도대체!
en_us: why?

source: 쟬 왜 줘...?
en_us: why...?

source: 넘을 수 없는 산이라구.
en_us: you’re setting yourself up for failure.

source: 봄스터치
en_us: Bom’s Touch

source: 다같이~~
en_us: all together!!!

source: 헤헤헤 멋있어~!! ><
en_us: hehehe, you’re amazing!!

source: 윤시아 Sia Yoon
en_us: Sia Yoon

source: 100일만에 훈남되기 가능?
en_us: can you really become a stud in 100 days?

source: 암튼, 1년만에 나오는 극장판인데다가 오랜만에 영화관에 가려니 넘 설레~
en_us: anyway, it’s been a year since the last cube monster movie, and I haven’t been to the theater in a while. I’m so excited!

source: 후후후, 그래 그래...
en_us: ho-ho, so...

source: 두고봐!
en_us: you just wait!

source: 작사 휴우가 사쿠라
en_us: Lyrics: Fyuuga Sakura

source: 그건 광고라서 어쩔 수가...!!
en_us: that was an ad. I couldn’t help it!!

source: 넘 예뻐요
en_us: so pretty!

source: 인기가 없을 리가 없지!
en_us: ...of course our channel would be popular!

source: 현재음정 남성A 원음정 남성A
en_us: Current key: Male A Original key: Male A

source: 자, 고생했어 김민호~
en_us: here, minho. good job!

source: 뭐야, 다 기억하나 보네?
en_us: you remember everything?

source: 그 중요한 걸 왜 여태 말 안 한거야!!
en_us: but why didn’t you tell me sooner?!

source: 한 달 전
en_us: one month ago

source: 아니, 너 분명 전에는 하기 싫다고 도망 갔으면서 이제는 다시하게 해달라고 떼까지 쓰니까...
en_us: I mean, you ran away, saying you didn’t want to. then you came back begging to join, even kneeling down for it.

source: 11시쯤이요
en_us: At about 11.

source: 두근...!!
en_us: BA-BUMP

source: 지금 안 그래도 온갖 커뮤니티에서 민호 얘기로 시끄럽잖아!
en_us: and he’s all over the internet right now!

source: 시아는 그저 날 도와주려고 했을 뿐인데...
en_us: sia was only trying to help me...

source: 시아 네 생각을 하면 그만둘 수 없었어.
en_us: ...but I couldn’t whenever I thought of you, sia.

source: 내일 어때?
en_us: how’s tmrw?

source: 어디서 고문 당하고 온 거 아니야!!?
en_us: did someone torture you?!
